# Пользователь вводит текст(строка) Словом считается последовательность
# непробельных символов идущих подряд, слова разделены пробелом.
# Определите сколько различных слов содержиться в этом тексте

print(len(set( input('Введите текст: ').lower().split())))



        
